void setup() {
  Serial.begin(9600);  // Налаштування швидкості серійного зв’язку
  while (!Serial) {
    ;  // Очікуємо підключення серійного порту
  }
}

void loop() {
  // Очікуємо отримання повідомлення
  if (Serial.available() > 0) {
    String message = Serial.readStringUntil('\n');  // Читання повідомлення до символу нового рядка
    message += " Copy";  // Модифікація повідомлення, додаємо "AR" в кінці

    // Відправлення модифікованого повідомлення назад клієнту
    Serial.println(message);  // Повертаємо змінене повідомлення
    
    // Після одного з'єднання зупиняємося (якщо не потрібна подальша комунікація)
    
  }
}
